compukidmike/Saintcon2025/Firmware/nut/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_DEVICE_TYPE_NUT=y
CONFIG_I2C_MANAGER_BUS_A_SDA_GPIO=2
CONFIG_I2C_MANAGER_BUS_A_SCL_GPIO=8
CONFIG_SECURE_ELEMENT_ENABLED=y
CONFIG_CONFERENCE_WIFI_SSID="LlamaNet-OutOfScope"
CONFIG_CONFERENCE_WIFI_PASSWORD="HiTherePlum!"
CONFIG_LED_NUM_LEDS=6
CONFIG_LED_GAMMA_CORRECTION=n
CONFIG_ETHERNET_SPI_SUPPORT=y
CONFIG_ETHERNET_SPI_SCLK_GPIO=5
CONFIG_ETHERNET_SPI_MOSI_GPIO=6
CONFIG_ETHERNET_SPI_MISO_GPIO=7
CONFIG_ETHERNET_SPI_CS0_GPIO=9
CONFIG_ETHERNET_SPI_INT0_GPIO=-1
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y
CONFIG_LWIP_IP4_REASSEMBLY=y
CONFIG_LWIP_IP6_REASSEMBLY=y
CONFIG_LWIP_SNTP_MAX_SERVERS=3
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y
CONFIG_MBEDTLS_GCM_SUPPORT_NON_AES_CIPHER=n
CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM=y
CONFIG_ATECC608A_TCUSTOM=y
CONFIG_DIAG_USE_EXTERNAL_LOG_WRAP=y
